{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "What is HandokHelper and who is it for?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper is a personal support service that helps you deal with German authorities and bureaucracy. It is designed for people who are moving to Germany, already living in Germany as foreigners, or living abroad but needing to handle German paperwork such as pension requests or registrations. HandokHelper supports you with housing search, immigration matters, official registrations, financial benefits and more, acting as your local contact in Germany."
      }
    },
    {
      "@type": "Question",
      "name": "Can HandokHelper help me find housing in Germany from abroad?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes. HandokHelper supports you with the housing search in Germany, even if you are still in another country. We can assist with finding apartments or houses, organizing viewings, communicating with landlords or housing companies, and checking rental contracts. We also help with the follow-up bureaucracy such as city registration (Anmeldung), so that you can move into your new home smoothly."
      }
    },
    {
      "@type": "Question",
      "name": "How does HandokHelper assist with German immigration and visas?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper offers support for visa applications, residence permits and other immigration procedures in Germany. We help you understand which visa or residence title you need, prepare the required documents, communicate with the Ausländerbehörde (foreigners’ office) and track deadlines. Typical cases include work visas, family reunion, study visas, Blue Card, and extending or changing your current residence permit. We guide you step by step through German legal and administrative requirements."
      }
    },
    {
      "@type": "Question",
      "name": "Can you help with German pension refunds or pension payments if I live abroad?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes, one of HandokHelper’s specialties is supporting people who live abroad but have pension rights in Germany. We help you apply for German pension refunds, request pension payments, clarify your insurance periods and communicate with the Deutsche Rentenversicherung. If you are unsure whether you are entitled to a payment or refund, we can check your situation, explain your options and prepare the necessary applications and forms."
      }
    },
    {
      "@type": "Question",
      "name": "I need help with German benefits (child benefit, family benefits, etc.). Is that possible?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper can assist you with a range of German social and financial benefits, such as child benefit (Kindergeld), certain family benefits or related bureaucratic procedures. We help you understand eligibility, collect the correct documentation, and submit applications to the responsible authorities. Our goal is to make sure that you do not miss out on benefits you are entitled to."
      }
    },
    {
      "@type": "Question",
      "name": "What kind of “authorities and documents” can HandokHelper handle for me?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "We can support you with almost any task that involves German authorities, offices or official documents. This includes city registration and deregistration, tax numbers, residence certificates, birth and marriage certificates, driver’s license exchange, insurance documents, and various confirmations required by German offices. We can also help you communicate with city halls, tax authorities, pension offices, immigration offices, and other institutions."
      }
    },
    {
      "@type": "Question",
      "name": "Can HandokHelper act on my behalf when I cannot be in Germany in person?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "In many cases, yes. If legally permitted and with the necessary authorizations or power of attorney, HandokHelper can carry out tasks on location in Germany for you. This includes submitting documents, attending appointments, picking up or sending official letters and clarifying matters directly with German authorities."
      }
    },
    {
      "@type": "Question",
      "name": "How does the process work from first contact to finished case?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "The process is straightforward. First, you submit your request via the contact form and select the service category that fits your situation. HandokHelper reviews your case and contacts you for a non-binding consultation. After agreeing on the scope of work and fees, we start handling your case, keep you informed, and support you until the matter is resolved."
      }
    },
    {
      "@type": "Question",
      "name": "What are the prices and payment options for HandokHelper’s services?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper offers fixed prices, hourly rates, or percentage-based fees, depending on the service and complexity. Before starting, you receive a clear offer with full transparency. Payments are typically made via bank transfer or online payment options."
      }
    },
    {
      "@type": "Question",
      "name": "Can HandokHelper help me set up banking, insurance, and other contracts in Germany?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Yes. Under the area of Integration & Daily Life, HandokHelper supports you with banking basics, insurance contracts (e.g., health or liability insurance), utilities (electricity, internet, gas) and other essential services. We help you compare options, understand terms, and complete necessary paperwork."
      }
    },
    {
      "@type": "Question",
      "name": "Is HandokHelper available to clients both inside and outside Germany?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Absolutely. HandokHelper works with clients living in Germany as well as those living abroad but needing to handle German authorities. We support you remotely by email, phone and, when needed, by acting locally in Germany."
      }
    },
    {
      "@type": "Question",
      "name": "In which languages does HandokHelper provide support?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper offers support in English, Korean (한국어) and German (Deutsch). This multilingual approach helps international clients seamlessly communicate and understand every step of their case."
      }
    },
    {
      "@type": "Question",
      "name": "Is HandokHelper a law firm or immigration lawyer?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper is not a law firm and does not replace legal advice. We specialize in practical support, communication with German authorities and helping you complete required documents. For complex legal cases requiring an attorney, we can advise you accordingly."
      }
    },
    {
      "@type": "Question",
      "name": "How quickly can HandokHelper start working on my case?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "Once you submit your request, HandokHelper reviews your case and contacts you promptly. Start time depends on urgency, complexity and authority deadlines. We always aim to begin as soon as possible."
      }
    },
    {
      "@type": "Question",
      "name": "How does HandokHelper ensure the security of my personal data?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "HandokHelper follows GDPR-compliant data protection standards. Your data is kept confidential, encrypted and only shared with authorities when necessary."
      }
    },
    {
      "@type": "Question",
      "name": "What if I am not sure which service I need?",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "If you are unsure, simply describe your situation in your own words in the contact form. HandokHelper will classify your request and guide you to the correct service category."
      }
    }
  ]
}